nrfconnect/sdk-nrf/drivers/wifi/nrf71/src/common/debug_shell.c
static void dump_debug_stats_detailed(const struct shell *sh,
				      const struct nrf_wifi_rpu_debug_stats *stats,
				      enum rpu_stats_type stats_type)
{
	if (stats_type == RPU_STATS_TYPE_UMAC) {
		shell_fprintf(sh, SHELL_INFO,
			      "UMAC debug stats (category=%u) umac_rx_dbg_params:\n",
			      stats->umac_stats.stats_category);
		dump_umac_rx_dbg_params(sh, &stats->umac_stats.rx_dbg_params);
	} else if (stats_type == RPU_STATS_TYPE_LMAC) {
		struct lmac_common_stats c;

		shell_fprintf(sh, SHELL_INFO, "LMAC debug stats (category=%u) lmac_common_stats:\n",
			      stats->lmac_stats.stats_category);
		memcpy(&c, (const char *)&stats->lmac_stats +
		       offsetof(struct lmac_debug_stats, lmac_common_stats), sizeof(c));
		dump_lmac_common_stats(sh, &c);
	} else if (stats_type == RPU_STATS_TYPE_PHY) {
		shell_fprintf(sh, SHELL_INFO, "PHY debug stats (full phy_debug_stats):\n");
		dump_phy_debug_stats(sh, &stats->phy_stats);
	}
}

static int nrf_wifi_dbg_debug_stats(const struct shell *sh,
				     size_t argc,
				     const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct nrf_wifi_rpu_debug_stats stats;
	enum rpu_stats_type stats_type = RPU_STATS_TYPE_UMAC;
	int ret = 0;

	if (argc == 2) {
		const char *type = argv[1];

		if (!strcmp(type, "umac")) {
			stats_type = RPU_STATS_TYPE_UMAC;
		} else if (!strcmp(type, "lmac")) {
			stats_type = RPU_STATS_TYPE_LMAC;
		} else if (!strcmp(type, "phy")) {
			stats_type = RPU_STATS_TYPE_PHY;
		} else {
			shell_fprintf(sh, SHELL_ERROR, "Invalid type %s (umac|lmac|phy)\n",
				      type);
			return -ENOEXEC;
		}
	}

	k_mutex_lock(&dbg_ctx->rpu_lock, K_FOREVER);
	if (!dbg_ctx->rpu_ctx) {
		shell_fprintf(sh, SHELL_ERROR, "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock_dbg;
	}
	fmac_dev_ctx = dbg_ctx->rpu_ctx;

	memset(&stats, 0, sizeof(stats));
	status = nrf_wifi_sys_fmac_debug_stats_get(fmac_dev_ctx, stats_type, &stats);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh, SHELL_ERROR, "Failed to get debug stats (timeout or error)\n");
		ret = -ENOEXEC;
	} else {
		shell_fprintf(sh, SHELL_INFO, "Debug stats received type=%d (%u bytes)\n",
			     stats_type, (unsigned int)sizeof(stats));
		dump_debug_stats_detailed(sh, &stats, stats_type);
	}
unlock_dbg:
	k_mutex_unlock(&dbg_ctx->rpu_lock);
	return ret;
}

static int nrf_wifi_dbg_umac_int_stats(const struct shell *sh,
					size_t argc,
					const char *argv[])
{
	enum nrf_wifi_status status = NRF_WIFI_STATUS_FAIL;
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	struct umac_int_stats stats;
	int ret = 0;
	unsigned int i;

	(void)argc;
	(void)argv;

	k_mutex_lock(&dbg_ctx->rpu_lock, K_FOREVER);
	if (!dbg_ctx->rpu_ctx) {
		shell_fprintf(sh, SHELL_ERROR, "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock_umac;
	}
	fmac_dev_ctx = dbg_ctx->rpu_ctx;

	memset(&stats, 0, sizeof(stats));
	status = nrf_wifi_sys_fmac_umac_int_stats_get(fmac_dev_ctx, &stats);
	if (status != NRF_WIFI_STATUS_SUCCESS) {
		shell_fprintf(sh, SHELL_ERROR,
			      "Failed to get UMAC int stats (timeout or error)\n");
		ret = -ENOEXEC;
		goto unlock_umac;
	}

	shell_fprintf(sh, SHELL_INFO, "UMAC internal (memory) stats received\n");
	shell_fprintf(sh, SHELL_INFO, "Scratch dynamic memory pools (first 8):\n");
	for (i = 0; i < 8; i++) {
		shell_fprintf(sh, SHELL_INFO, "  [%u] buffer_size=%u num_pool_items=%u\n",
			      i,
			      stats.scratch_dynamic_memory_info[i].buffer_size,
			      stats.scratch_dynamic_memory_info[i].num_pool_items);
	}
	shell_fprintf(sh, SHELL_INFO, "Retention dynamic memory pools (first 8):\n");
	for (i = 0; i < 8; i++) {
		shell_fprintf(sh, SHELL_INFO, "  [%u] buffer_size=%u num_pool_items=%u\n",
			      i,
			      stats.retention_dynamic_memory_info[i].buffer_size,
			      stats.retention_dynamic_memory_info[i].num_pool_items);
	}
unlock_umac:
	k_mutex_unlock(&dbg_ctx->rpu_lock);
	return ret;
}

#ifdef CONFIG_NRF71_STA_MODE
static int nrf_wifi_dbg_tx_stats(const struct shell *sh,
				  size_t argc,
				  const char *argv[])
{
	int vif_index = -1;
	int peer_index = 0;
	int max_vif_index = MAX(MAX_NUM_APS, MAX_NUM_STAS);
	struct nrf_wifi_fmac_dev_ctx *fmac_dev_ctx = NULL;
	unsigned int tx_pending_pkts = 0;
	struct nrf_wifi_sys_fmac_dev_ctx *sys_dev_ctx = NULL;
	int ret;

	vif_index = atoi(argv[1]);
	if ((vif_index < 0) || (vif_index >= max_vif_index)) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "Invalid vif index(%d).\n",
			      vif_index);
		shell_help(sh);
		return -ENOEXEC;
	}

	k_mutex_lock(&dbg_ctx->rpu_lock, K_FOREVER);
	if (!dbg_ctx->rpu_ctx) {
		shell_fprintf(sh,
			      SHELL_ERROR,
			      "RPU context not initialized\n");
		ret = -ENOEXEC;
		goto unlock;
	}

	fmac_dev_ctx = dbg_ctx->rpu_ctx;
	sys_dev_ctx = wifi_dev_priv(fmac_dev_ctx);

	/* TODO: Get peer_index from shell once AP mode is supported */
	shell_fprintf(sh,
		SHELL_INFO,
		"************* Tx Stats: vif(%d) peer(0) ***********\n",
		vif_index);

	for (int i = 0; i < NRF_WIFI_FMAC_AC_MAX ; i++) {
		tx_pending_pkts = (unsigned int)sys_dlist_len(
			&sys_dev_ctx->tx_config.pend_pkt_q[peer_index][i]);

		shell_fprintf(
			sh,
			SHELL_INFO,
			"Outstanding tokens: ac: %d -> %d (pending_q_len: %d)\n",
			i,
			sys_dev_ctx->tx_config.outstanding_descs[i],
			tx_pending_pkts);
	}

	ret = 0;

unlock:
	k_mutex_unlock(&dbg_ctx->rpu_lock);
	return ret;
}
#endif /* CONFIG_NRF71_STA_MODE */

static int nrf_wifi_dbg_heap(const struct shell *sh, size_t argc, char **argv)
{
	struct k_heap *ctrl_pool;
	struct k_heap *data_pool;
	struct sys_memory_stats stats;
	int err;

	ARG_UNUSED(argc);
	ARG_UNUSED(argv);

	nrf_wifi_mem_get_heaps(&ctrl_pool, &data_pool);

	err = sys_heap_runtime_stats_get(&ctrl_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read control heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Control pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	err = sys_heap_runtime_stats_get(&data_pool->heap, &stats);
	if (err) {
		shell_error(sh, "Failed to read data heap statistics (err %d)", err);
		return -ENOEXEC;
	}
	shell_print(sh, "Data pool:");
	shell_print(sh, "  free:           %zu", stats.free_bytes);
	shell_print(sh, "  allocated:      %zu", stats.allocated_bytes);
	shell_print(sh, "  max. allocated: %zu", stats.max_allocated_bytes);

	return 0;
}

SHELL_STATIC_SUBCMD_SET_CREATE(
	nrf71_dbg,
	SHELL_CMD_ARG(rpu_stats,
		      NULL,
		      "Display RPU stats "
		      "Parameters: umac or lmac or phy or all (default)",
		      nrf_wifi_dbg_dump_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(clear_rpu_stats,
		      NULL,
		      "Clear RPU stats. Parameters: umac|lmac|phy|all (default)",
		      nrf_wifi_dbg_clear_rpu_stats,
		      1,
		      1),
	SHELL_CMD_ARG(debug_stats,
		      NULL,
		      "Request debug stats from RPU. Parameters: umac|lmac|phy",
		      nrf_wifi_dbg_debug_stats,
		      1,
		      1),
	SHELL_CMD_ARG(umac_int_stats,
		      NULL,
		      "Request UMAC internal (memory pool) stats from RPU",
		      nrf_wifi_dbg_umac_int_stats,
		      1,
		      0),
#ifdef CONFIG_NRF71_STA_MODE
	SHELL_CMD_ARG(tx_stats,
		      NULL,
		      "Displays transmit statistics\n"
			  "vif_index: 0 - 1\n",
		      nrf_wifi_dbg_tx_stats,
		      2,
		      0),
#endif /* CONFIG_NRF71_STA_MODE */
	SHELL_CMD_ARG(heap,
		      NULL,
		      "Control and data pool heap usage statistics",
		      nrf_wifi_dbg_heap,
		      1,
		      0),
	SHELL_SUBCMD_SET_END);

SHELL_SUBCMD_ADD((nrf71), dbg, &nrf71_dbg, "nRF71 debug commands\n", NULL, 0, 0);
